; domain
(define (domain zeno-travel)
(:requirements :typing :fluents)
(:types aircraft person city - object)
(:predicates (at ?x - (either person aircraft) ?c - city)
             (in ?p - person ?a - aircraft))
(:functions (fuel ?a - aircraft)
            (distance ?c1 - city ?c2 - city)
            (slow-burn ?a - aircraft)
            (fast-burn ?a - aircraft)
            (capacity ?a - aircraft)
            (total-fuel-used)
	    (onboard ?a - aircraft)
            (zoom-limit ?a - aircraft)
            )


(:action board
 :parameters (?p - person ?a - aircraft ?c - city)
 :precondition (and (at ?p ?c)
                 (at ?a ?c))
 :effect (and (not (at ?p ?c))
              (in ?p ?a)
		(increase (onboard ?a) 1)))


(:action debark
 :parameters (?p - person ?a - aircraft ?c - city)
 :precondition (and (in ?p ?a)
                 (at ?a ?c))
 :effect (and (not (in ?p ?a))
              (at ?p ?c)
		(decrease (onboard ?a) 1)))

(:action fly 
 :parameters (?a - aircraft ?c1 ?c2 - city)
 :precondition (and (at ?a ?c1)
                 (>= (fuel ?a) 
                         (* (distance ?c1 ?c2) (slow-burn ?a))))
 :effect (and (not (at ?a ?c1))
              (at ?a ?c2)
              (increase (total-fuel-used)
                         (* (distance ?c1 ?c2) (slow-burn ?a)))
              (decrease (fuel ?a) 
                         (* (distance ?c1 ?c2) (slow-burn ?a)))))
                                  
(:action zoom
 :parameters (?a - aircraft ?c1 ?c2 - city)
 :precondition (and (at ?a ?c1)
                 (>= (fuel ?a) 
                         (* (distance ?c1 ?c2) (fast-burn ?a)))
                 (<= (onboard ?a) (zoom-limit ?a)))
 :effect (and (not (at ?a ?c1))
              (at ?a ?c2)
              (increase (total-fuel-used)
                         (* (distance ?c1 ?c2) (fast-burn ?a)))
              (decrease (fuel ?a) 
                         (* (distance ?c1 ?c2) (fast-burn ?a)))
	)
) 

(:action refuel	
 :parameters (?a - aircraft ?c - city)
 :precondition (and (> (capacity ?a) (fuel ?a))
               (at ?a ?c)
		)
 :effect (and (assign (fuel ?a) (capacity ?a)))
)


)

; problem
(define (problem ZTRAVEL-4-9)
(:domain zeno-travel)
(:objects
	plane1 - aircraft
	plane2 - aircraft
	plane3 - aircraft
	plane4 - aircraft
	person1 - person
	person2 - person
	person3 - person
	person4 - person
	person5 - person
	person6 - person
	person7 - person
	person8 - person
	person9 - person
	city0 - city
	city1 - city
	city2 - city
	city3 - city
	city4 - city
	city5 - city
	city6 - city
	city7 - city
	)
(:init
	(at plane1 city7)
	(= (capacity plane1) 8692)
	(= (fuel plane1) 39)
	(= (slow-burn plane1) 4)
	(= (fast-burn plane1) 15)
	(= (onboard plane1) 0)
	(= (zoom-limit plane1) 10)
	(at plane2 city3)
	(= (capacity plane2) 8519)
	(= (fuel plane2) 628)
	(= (slow-burn plane2) 4)
	(= (fast-burn plane2) 11)
	(= (onboard plane2) 0)
	(= (zoom-limit plane2) 5)
	(at plane3 city7)
	(= (capacity plane3) 15054)
	(= (fuel plane3) 4811)
	(= (slow-burn plane3) 5)
	(= (fast-burn plane3) 12)
	(= (onboard plane3) 0)
	(= (zoom-limit plane3) 6)
	(at plane4 city5)
	(= (capacity plane4) 2195)
	(= (fuel plane4) 377)
	(= (slow-burn plane4) 1)
	(= (fast-burn plane4) 2)
	(= (onboard plane4) 0)
	(= (zoom-limit plane4) 3)
	(at person1 city3)
	(at person2 city3)
	(at person3 city3)
	(at person4 city2)
	(at person5 city3)
	(at person6 city0)
	(at person7 city5)
	(at person8 city2)
	(at person9 city5)
	(= (distance city0 city0) 0)
	(= (distance city0 city1) 607)
	(= (distance city0 city2) 544)
	(= (distance city0 city3) 660)
	(= (distance city0 city4) 799)
	(= (distance city0 city5) 960)
	(= (distance city0 city6) 504)
	(= (distance city0 city7) 624)
	(= (distance city1 city0) 607)
	(= (distance city1 city1) 0)
	(= (distance city1 city2) 846)
	(= (distance city1 city3) 679)
	(= (distance city1 city4) 911)
	(= (distance city1 city5) 559)
	(= (distance city1 city6) 777)
	(= (distance city1 city7) 691)
	(= (distance city2 city0) 544)
	(= (distance city2 city1) 846)
	(= (distance city2 city2) 0)
	(= (distance city2 city3) 644)
	(= (distance city2 city4) 911)
	(= (distance city2 city5) 654)
	(= (distance city2 city6) 929)
	(= (distance city2 city7) 839)
	(= (distance city3 city0) 660)
	(= (distance city3 city1) 679)
	(= (distance city3 city2) 644)
	(= (distance city3 city3) 0)
	(= (distance city3 city4) 519)
	(= (distance city3 city5) 516)
	(= (distance city3 city6) 549)
	(= (distance city3 city7) 652)
	(= (distance city4 city0) 799)
	(= (distance city4 city1) 911)
	(= (distance city4 city2) 911)
	(= (distance city4 city3) 519)
	(= (distance city4 city4) 0)
	(= (distance city4 city5) 589)
	(= (distance city4 city6) 683)
	(= (distance city4 city7) 549)
	(= (distance city5 city0) 960)
	(= (distance city5 city1) 559)
	(= (distance city5 city2) 654)
	(= (distance city5 city3) 516)
	(= (distance city5 city4) 589)
	(= (distance city5 city5) 0)
	(= (distance city5 city6) 794)
	(= (distance city5 city7) 635)
	(= (distance city6 city0) 504)
	(= (distance city6 city1) 777)
	(= (distance city6 city2) 929)
	(= (distance city6 city3) 549)
	(= (distance city6 city4) 683)
	(= (distance city6 city5) 794)
	(= (distance city6 city6) 0)
	(= (distance city6 city7) 520)
	(= (distance city7 city0) 624)
	(= (distance city7 city1) 691)
	(= (distance city7 city2) 839)
	(= (distance city7 city3) 652)
	(= (distance city7 city4) 549)
	(= (distance city7 city5) 635)
	(= (distance city7 city6) 520)
	(= (distance city7 city7) 0)
	(= (total-fuel-used) 0)
)
(:goal (and
	(at person1 city2)
	(at person2 city0)
	(at person3 city4)
	(at person4 city1)
	(at person5 city1)
	(at person6 city3)
	(at person7 city4)
	(at person8 city5)
	(at person9 city6)
	))

(:metric minimize (+ (* 3 (total-time))  (* 1 (total-fuel-used))))
)

; plan
1. (fly plane3 city7 city4)
   deleted: (at plane3 city7)
   added: (at plane3 city4)
   changed: (total-fuel-used) from 0 to 2745, (fuel plane3) from 4811 to 2066
   goals met: 0 of 9
2. (refuel plane2 city3)
   changed: (fuel plane2) from 628 to 8519
   goals met: 0 of 9
3. (board person1 plane2 city3)
   deleted: (at person1 city3)
   added: (in person1 plane2)
   changed: (onboard plane2) from 0 to 1
   goals met: 0 of 9
4. (board person2 plane2 city3)
   deleted: (at person2 city3)
   added: (in person2 plane2)
   changed: (onboard plane2) from 1 to 2
   goals met: 0 of 9
5. (board person3 plane2 city3)
   deleted: (at person3 city3)
   added: (in person3 plane2)
   changed: (onboard plane2) from 2 to 3
   goals met: 0 of 9
6. (board person5 plane2 city3)
   deleted: (at person5 city3)
   added: (in person5 plane2)
   changed: (onboard plane2) from 3 to 4
   goals met: 0 of 9
7. (fly plane2 city3 city2)
   deleted: (at plane2 city3)
   added: (at plane2 city2)
   changed: (total-fuel-used) from 2745 to 5321, (fuel plane2) from 8519 to 5943
   goals met: 0 of 9
8. (debark person1 plane2 city2)
   deleted: (in person1 plane2)
   added: (at person1 city2)
   changed: (onboard plane2) from 4 to 3
   goals met: 1 of 9
9. (board person4 plane2 city2)
   deleted: (at person4 city2)
   added: (in person4 plane2)
   changed: (onboard plane2) from 3 to 4
   goals met: 1 of 9
10. (board person8 plane2 city2)
   deleted: (at person8 city2)
   added: (in person8 plane2)
   changed: (onboard plane2) from 4 to 5
   goals met: 1 of 9
11. (fly plane2 city2 city0)
   deleted: (at plane2 city2)
   added: (at plane2 city0)
   changed: (total-fuel-used) from 5321 to 7497, (fuel plane2) from 5943 to 3767
   goals met: 1 of 9
12. (debark person2 plane2 city0)
   deleted: (in person2 plane2)
   added: (at person2 city0)
   changed: (onboard plane2) from 5 to 4
   goals met: 2 of 9
13. (board person6 plane2 city0)
   deleted: (at person6 city0)
   added: (in person6 plane2)
   changed: (onboard plane2) from 4 to 5
   goals met: 2 of 9
14. (fly plane2 city0 city1)
   deleted: (at plane2 city0)
   added: (at plane2 city1)
   changed: (total-fuel-used) from 7497 to 9925, (fuel plane2) from 3767 to 1339
   goals met: 2 of 9
15. (refuel plane2 city1)
   changed: (fuel plane2) from 1339 to 8519
   goals met: 2 of 9
16. (debark person4 plane2 city1)
   deleted: (in person4 plane2)
   added: (at person4 city1)
   changed: (onboard plane2) from 5 to 4
   goals met: 3 of 9
17. (debark person5 plane2 city1)
   deleted: (in person5 plane2)
   added: (at person5 city1)
   changed: (onboard plane2) from 4 to 3
   goals met: 4 of 9
18. (fly plane2 city1 city4)
   deleted: (at plane2 city1)
   added: (at plane2 city4)
   changed: (total-fuel-used) from 9925 to 13569, (fuel plane2) from 8519 to 4875
   goals met: 4 of 9
19. (debark person3 plane2 city4)
   deleted: (in person3 plane2)
   added: (at person3 city4)
   changed: (onboard plane2) from 3 to 2
   goals met: 5 of 9
20. (fly plane2 city4 city3)
   deleted: (at plane2 city4)
   added: (at plane2 city3)
   changed: (total-fuel-used) from 13569 to 15645, (fuel plane2) from 4875 to 2799
   goals met: 5 of 9
21. (debark person6 plane2 city3)
   deleted: (in person6 plane2)
   added: (at person6 city3)
   changed: (onboard plane2) from 2 to 1
   goals met: 6 of 9
22. (fly plane2 city3 city5)
   deleted: (at plane2 city3)
   added: (at plane2 city5)
   changed: (total-fuel-used) from 15645 to 17709, (fuel plane2) from 2799 to 735
   goals met: 6 of 9
23. (debark person8 plane2 city5)
   deleted: (in person8 plane2)
   added: (at person8 city5)
   changed: (onboard plane2) from 1 to 0
   goals met: 7 of 9
24. (refuel plane4 city5)
   changed: (fuel plane4) from 377 to 2195
   goals met: 7 of 9
25. (board person7 plane4 city5)
   deleted: (at person7 city5)
   added: (in person7 plane4)
   changed: (onboard plane4) from 0 to 1
   goals met: 7 of 9
26. (board person9 plane4 city5)
   deleted: (at person9 city5)
   added: (in person9 plane4)
   changed: (onboard plane4) from 1 to 2
   goals met: 7 of 9
27. (fly plane4 city5 city4)
   deleted: (at plane4 city5)
   added: (at plane4 city4)
   changed: (total-fuel-used) from 17709 to 18298, (fuel plane4) from 2195 to 1606
   goals met: 7 of 9
28. (debark person7 plane4 city4)
   deleted: (in person7 plane4)
   added: (at person7 city4)
   changed: (onboard plane4) from 2 to 1
   goals met: 8 of 9
29. (fly plane4 city4 city6)
   deleted: (at plane4 city4)
   added: (at plane4 city6)
   changed: (total-fuel-used) from 18298 to 18981, (fuel plane4) from 1606 to 923
   goals met: 8 of 9
30. (debark person9 plane4 city6)
   deleted: (in person9 plane4)
   added: (at person9 city6)
   changed: (onboard plane4) from 1 to 0
   goals met: 9 of 9
